/**
* Copyright (c), 2015-2025
* @file FHZ20.c
* @brief 20ºÅºº×Ö×Ö¿â,×ÖÌåÎ¢ÈíÑÅºÚ
* @author jdh
* @date 2015/9/6
* @date 2015/9/7
* @date 2015/9/9
*/

/*********************************************************************
*							Í·ÎÄ¼ş
**********************************************************************/

#include "font.h"

/*********************************************************************
*							¾²Ì¬±äÁ¿
**********************************************************************/

/**
* @brief ×Ö·û:¿Õ
*/
  
unsigned char Hz20_0020[ 20] = { /* code 0020, SPACE */
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_002E[ 20] = { /* code 002E, FULL STOP */
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  ________,
  _XX_____,
  _XX_____,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0030[ 20] = { /* code 0030, DIGIT ZERO */
  ________,
  ________,
  ________,
  ________,
  ________,
  ___XXX__,
  __X__X__,
  _X____X_,
  _X____X_,
  _X____X_,
  _X____X_,
  _X____X_,
  _X____X_,
  _X____X_,
  __X__X__,
  __XXX___,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0031[ 20] = { /* code 0031, DIGIT ONE */
  ________,
  ________,
  ________,
  ________,
  ________,
  ____X___,
  __XXX___,
  _XX_X___,
  ____X___,
  ____X___,
  ____X___,
  ____X___,
  ____X___,
  ____X___,
  ____X___,
  ____X___,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0032[ 20] = { /* code 0032, DIGIT TWO */
  ________,
  ________,
  ________,
  ________,
  ________,
  __XXXX__,
  _X___XX_,
  ______X_,
  ______X_,
  ______X_,
  _____X__,
  ___XX___,
  __XX____,
  _XX_____,
  _X______,
  _XXXXXX_,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0033[ 20] = { /* code 0033, DIGIT THREE */
  ________,
  ________,
  ________,
  ________,
  ________,
  __XXX___,
  _X___X__,
  _____X__,
  _____X__,
  ____XX__,
  __XX____,
  ____XX__,
  _____X__,
  _____X__,
  _X__XX__,
  __XXX___,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0034[ 20] = { /* code 0034, DIGIT FOUR */
  ________,
  ________,
  ________,
  ________,
  ________,
  _____X__,
  ____XX__,
  ___XXX__,
  ___X_X__,
  __X__X__,
  _XX__X__,
  XX___X__,
  XXXXXXXX,
  _____X__,
  _____X__,
  _____X__,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0035[ 20] = { /* code 0035, DIGIT FIVE */
  ________,
  ________,
  ________,
  ________,
  ________,
  _XXXXX__,
  _X______,
  _X______,
  _X______,
  _X______,
  _XXXXX__,
  _____XX_,
  ______X_,
  ______X_,
  _____XX_,
  _XXXX___,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0036[ 20] = { /* code 0036, DIGIT SIX */
  ________,
  ________,
  ________,
  ________,
  ________,
  ___XXX__,
  __X_____,
  _X______,
  _X______,
  _X_XXX__,
  _XX__XX_,
  _X____X_,
  _X____X_,
  _X____X_,
  __X__X__,
  ___XXX__,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0037[ 20] = { /* code 0037, DIGIT SEVEN */
  ________,
  ________,
  ________,
  ________,
  ________,
  XXXXXXX_,
  _____X__,
  _____X__,
  ____X___,
  ____X___,
  ___X____,
  ___X____,
  ___X____,
  __X_____,
  __X_____,
  __X_____,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0038[ 20] = { /* code 0038, DIGIT EIGHT */
  ________,
  ________,
  ________,
  ________,
  ________,
  __XXXX__,
  _XX__XX_,
  _X____X_,
  _X____X_,
  __X__X__,
  __XXXX__,
  _XX__XX_,
  _X____X_,
  _X____X_,
  _XX__XX_,
  __XXXX__,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_0039[ 20] = { /* code 0039, DIGIT NINE */
  ________,
  ________,
  ________,
  ________,
  ________,
  __XXXX__,
  __X__X__,
  _X____X_,
  _X____X_,
  _X____X_,
  _XX__XX_,
  __XXX_X_,
  ______X_,
  _____X__,
  __X__X__,
  __XXX___,
  ________,
  ________,
  ________,
  ________};

unsigned char Hz20_006D[ 40] = { /* code 006D, LATIN SMALL LETTER M */
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  _X_XXX__,XXX_____,
  _XX__XXX,___X____,
  _X____X_,___X____,
  _X____X_,___X____,
  _X____X_,___X____,
  _X____X_,___X____,
  _X____X_,___X____,
  _X____X_,___X____,
  ________,________,
  ________,________,
  ________,________,
  ________,________};

unsigned char Hz20_CBD1[ 40] = { /* code 641C */
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  __X___XX,X_______,
  __X__XX_,XXXXX___,
  XXXXXX__,X___X___,
  __X__XXX,X_XXX___,
  __X__X__,X___X___,
  __XX_XXX,XXXXX___,
  _XXXX___,X_______,
  X_X__XXX,XXXX____,
  __X___X_,__XX____,
  __X____X,_XX_____,
  __X____X,XX______,
  XXX_XXX_,__XXXX__,
  ________,________,
  ________,________,
  ________,________};

unsigned char Hz20_CBF7[ 40] = { /* code 7D22 */
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  _______X,________,
  _XXXXXXX,XXXXX___,
  _______X,________,
  _XXXXXXX,XXXXX___,
  _X___X__,XX__X___,
  _X_XXXXX,X___X___,
  ______X_,_XX_____,
  ____XX__,__XX____,
  __XXXXXX,XXXXX___,
  ____X__X,_X______,
  __XX___X,__XX____,
  XX__XXXX,____X___,
  ________,________,
  ________,________,
  ________,________};

/**
* @brief ×Ö·û:Õı
*/
  
unsigned char Hz20_D5FD[ 40] = { /* code 6B63 */
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  _XXXXXXX,XXXXX___,
  _______X,________,
  _______X,________,
  __X____X,________,
  __X____X,________,
  __X____X,XXXXX___,
  __X____X,________,
  __X____X,________,
  __X____X,________,
  __X____X,________,
  __X____X,________,
  XXXXXXXX,XXXXXX__,
  ________,________,
  ________,________,
  ________,________};

/**
* @brief ×Ö·û:³£
*/
  
unsigned char Hz20_B3A3[ 40] = { /* code 5E38 */
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  __XX__X_,__XX____,
  ___XX_X_,_XX_____,
  _XXXXXXX,XXXXX___,
  _X______,____X___,
  _X_XXXXX,XXX_X___,
  ___X____,__X_____,
  ___XXXXX,XXX_____,
  _______X,________,
  __XXXXXX,XXXX____,
  __X____X,___X____,
  __X____X,_XXX____,
  _______X,________,
  ________,________,
  ________,________,
  ________,________};

/**
* @brief ×Ö·û:³¬
*/
  
unsigned char Hz20_B3AC[ 40] = { /* code 8D85 */
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ___X__XX,XXXXX___,
  ___X____,X___X___,
  XXXXXX__,X___X___,
  ___X___X,____X___,
  ___X__X_,_XXX____,
  XXXXXX__,________,
  ___X___X,XXXXX___,
  _X_X___X,____X___,
  _X_XXX_X,____X___,
  _X_X___X,XXXXX___,
  X_XX____,________,
  X__XXXXX,XXXXXX__,
  ________,________,
  ________,________,
  ________,________};

/**
* @brief ×Ö·û:¾à
*/

unsigned char Hz20_BEE0[ 40] = { /* code 8DDD */
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  _XXXX__X,XXXXXX__,
  _X__X__X,________,
  _X__X__X,________,
  _XXXX__X,________,
  _X_X___X,XXXXX___,
  ___X___X,____X___,
  _X_XXX_X,____X___,
  _X_X___X,XXXXX___,
  _X_X___X,____X___,
  _X_X___X,________,
  _X_XXX_X,________,
  XXX____X,XXXXXX__,
  ________,________,
  ________,________,
  ________,________};

/**
* @brief ×Ö·û:Ê§
*/

unsigned char Hz20_CAA7[ 40] = { /* code 5931 */
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ___X___X,________,
  ___X___X,________,
  __XXXXXX,XXXXX___,
  __X____X,________,
  _X_____X,________,
  _______X,________,
  _XXXXXXX,XXXXXX__,
  ______XX,________,
  ______X_,X_______,
  ____XX__,_X______,
  __XX____,__XX____,
  XX______,____XX__,
  ________,________,
  ________,________,
  ________,________};

/**
* @brief ×Ö·û:×Ù
*/
  
unsigned char Hz20_D7D9[ 40] = { /* code 8E2A */
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  ________,________,
  _XXXX___,_XX_____,
  _X__X_XX,XXXXXX__,
  _X__X_X_,_____X__,
  _XXXX___,________,
  _X_X___X,XXXXX___,
  ___X____,________,
  _X_XX_XX,XXXXXX__,
  _X_X____,_X______,
  _X_X___X,_X_X____,
  _X_X__X_,_X__X___,
  XXX_XX__,_X___X__,
  _______X,XX______,
  ________,________,
  ________,________,
  ________,________};

/*********************************************************************
*							º¯Êı
**********************************************************************/

/**
* @brief µÃµ½×ÖÌå¸ß¶È
* @param font:×ÖÌå
* @retval ¸ß¶È
*/

uint8_t GB18030_20X20_get_height(void)
{
	return 20;
}

/**
* @brief µÃµ½µØÖ·
* @param font:×ÖÌå
* @param ch:´ı¶ÁÈ¡µÄ×Ö·û
* @param addr:Êı¾İ´æ´¢µØÖ·
* @retval ¶ÁÈ¡½á¹û.0:Ê§°Ü,1:³É¹¦
*/

uint8_t GB18030_20X20_get_address(uint16_t ch,struct _Font_Type *font_type,uint32_t *addr) 
{ 
	switch (ch)
	{
		//¿Õ
		case 0x0020:
		{
			font_type->width = 4;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0020;
			break;
		}
		//.
		case 0x002E:
		{
			font_type->width = 3;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_002E;
			break;
		}
		//0
		case 0x0030:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0030;
			break;
		}
		//1
		case 0x0031:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0031;
			break;
		}
		//2
		case 0x0032:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0032;
			break;
		}
		//3
		case 0x0033:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0033;
			break;
		}
		//4
		case 0x0034:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0034;
			break;
		}
		//5
		case 0x0035:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0035;
			break;
		}
		//6
		case 0x0036:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0036;
			break;
		}
		//7
		case 0x0037:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0037;
			break;
		}
		//8
		case 0x0038:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0038;
			break;
		}
		//9
		case 0x0039:
		{
			font_type->width = 8;
			font_type->height = 20;
			font_type->size = 20;
			*addr = (uint32_t)Hz20_0039;
			break;
		}
		//m
		case 0x006D:
		{
			font_type->width = 13;
			font_type->height = 20;
			font_type->size = 40;
			*addr = (uint32_t)Hz20_006D;
			break;
		}
		//ËÑ
		case 0xCBD1:
		{
			font_type->width = 14;
			font_type->height = 20;
			font_type->size = 40;
			*addr = (uint32_t)Hz20_CBD1;
			break;
		}
		//Ë÷
		case 0xCBF7:
		{
			font_type->width = 14;
			font_type->height = 20;
			font_type->size = 40;
			*addr = (uint32_t)Hz20_CBF7;
			break;
		}
		//Õı
		case 0xD5FD:
		{
			font_type->width = 14;
			font_type->height = 20;
			font_type->size = 40;
			*addr = (uint32_t)Hz20_D5FD;
			break;
		}
		//³£
		case 0xB3A3:
		{
			font_type->width = 14;
			font_type->height = 20;
			font_type->size = 40;
			*addr = (uint32_t)Hz20_B3A3;
			break;
		}
		//³¬
		case 0xB3AC:
		{
			font_type->width = 14;
			font_type->height = 20;
			font_type->size = 40;
			*addr = (uint32_t)Hz20_B3AC;
			break;
		}
		//¾à
		case 0xBEE0:
		{
			font_type->width = 14;
			font_type->height = 20;
			font_type->size = 40;
			*addr = (uint32_t)Hz20_BEE0;
			break;
		}
		//Ê§
		case 0xCAA7:
		{
			font_type->width = 14;
			font_type->height = 20;
			font_type->size = 40;
			*addr = (uint32_t)Hz20_CAA7;
			break;
		}
		//×Ù
		case 0xD7D9:
		{
			font_type->width = 14;
			font_type->height = 20;
			font_type->size = 40;
			*addr = (uint32_t)Hz20_D7D9;
			break;
		}
		default:
		{
			return 0;
		}
	}
	
	return 1;
}


